Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: If you return false from onDown(), as GestureDetector.SimpleOnGestureListener does, the system assumes that you want to ignore the rest of the gesture, and the other methods of GestureDetector.OnGestureListener never get called.
zh_cn: 如果从 onDown() 返回 false，像 GestureDetector.SimpleOnGestureListener 一样，则系统假定你要忽略手势的其余部分，并且永远不会调用 GestureDetector.OnGestureListener 的其他方法。

source: If you return true from here, you will not receive any following events: the target view will receive the same event but with the action MotionEvent#ACTION_CANCEL, and all further events will be delivered to your onTouchEvent() method and no longer appear here.
zh_cn: 如果从此处返回 true，则不会收到任何后续事件：目标 view 将接收相同的事件，但操作是 MotionEvent#ACTION_CANCEL，所有其他事件将被传递到你的 onTouchEvent() 方法，不再出现在这里。

source: If you see old code that has a @deprecated Javadoc tag, please add the @Deprecated annotation.
zh_cn: 如果你看到带有 @deprecated Javadoc 标记的旧代码，请添加 @Deprecated 注释。

source: If you select lossy encoding, set the encoding quality, and choose whether or not to view a preview of each converted image before saving.
zh_cn: 如果选择有损编码，请设置编码质量，并选择是否在保存之前查看每个转换图像的预览。

source: If you selected lossless conversion above, the conversion happens immediately.
zh_cn: 如果你选择了上面的无损转换，则会立即进行转换。

source: If you selected lossy conversion, and you chose to view a preview of each converted image before saving, Android Studio shows you each image during the conversion so you can inspect the conversion result.
zh_cn: 如果你选择了有损转换，并且选择在保存之前查看每个转换图像的预览，Android Studio 会在转换过程中显示每个图像，以便你可以检查转换结果。

source: If you selected lossy conversion, continue on to the next step.
zh_cn: 如果你选择了有损转换，请继续执行下一步。

source: If you set a background drawable for a View, then the View will draw it before calling back to its onDraw() method.
zh_cn: 如果你为 view 设置了一个背景 drawable，view 将在回调 onDraw() 之前绘制背景。

source: If you skip a column number, it will be considered an empty cell in that row.
zh_cn: 如果跳过列号，则该行将被视为空单元格。

source: If you supply an initial capacity of 0, the sparse array will be initialized with a light-weight representation not requiring any additional array allocations.
zh_cn: 如果初始容量为 0，稀疏数组将使用不需要任何额外数组分配的轻量级表示进行初始化。

source: If you use AppBarLayout within a different ViewGroup, most of its functionality will not work.
zh_cn: 如果你在不同的 ViewGroup 中使用 AppBarLayout，则其大部分功能将无效。

source: If you use a navigation icon you should also set a description for its action using setNavigationContentDescription(int).
zh_cn: 如果使用导航图标，则还应使用 setNavigationContentDescription(int) 为其操作设置描述。

source: If you use the @Deprecated annotation, you must also have a @deprecated Javadoc tag and it should name an alternate implementation.
zh_cn: 如果你使用 @Deprecated 注释，则还必须为其添加 @deprecated Javadoc 标记，并且该标记应该指定一个替代实现方案。

source: If you want more control, DiffUtil is the lower-level API you can use to compute the diffs yourself.
zh_cn: 如果你想要更多控制，DiffUtil 是你可以用来自己计算差异的低级 API。

source: If you want the search field to always be visible, then call setIconifiedByDefault(false).
zh_cn: 如果希望搜索域始终可见，则调用 setIconifiedByDefault(false)。

source: If you want to change elevation dynamically, you should call setMaxCardElevation(float) when CardView is initialized.
zh_cn: 如果要动态更改高程，则应在初始化 CardView 时调用 setMaxCardElevation(float)。

source: If you want to maintain compatibility with previous versions, you should send one content URI at a time in the Intent.
zh_cn: 如果你想保持与以前版本的兼容性，你应该一次在 Intent 中发送一个 content URI。

source: If you want to override any of the default behavior of FileProvider methods, extend the FileProvider class and use the fully-qualified class name in the android:name attribute of the <provider> element.
zh_cn: 如果要覆盖 FileProvider 方法的任何默认行为，请继承 FileProvider 类并在 <provider> 的 android:name 属性中使用完全限定的类名称。

source: If you want to specify a distance that leads to visually consistent results across various densities, use the following formula:
zh_cn: 如果要指定一个在不同密度下产生视觉一致结果的距离，请使用以下公式：

source: If you want to use 3D graphics, you must extend SurfaceView instead of View, and draw from a separate thread.
zh_cn: 如果你想要使用 3D 图形，你必须继承 SurfaceView 而不是 View，并从一个独立的线程画图。

source: If you want to use a WebP image from your project for another purpose (for example, in a web page that needs to correctly display images in a browser without WebP support), you can use Android Studio to convert WebP images to PNG format.
zh_cn: 如果要将项目中的 WebP 图像用于其他目的(例如，在需要在没有 WebP 支持的浏览器中正确显示图像的网页中)，可以使用 Android Studio 将 WebP 图像转换为 PNG 格式。

source: If you wish to change this at runtime then you can do so via setBackgroundTintList(ColorStateList).
zh_cn: 如果你希望在运行时更改此设置，则可以通过 setBackgroundTintList(ColorStateList) 进行更改。

source: If you wish to change this at runtime then you can do so via setBackgroundTintList(android.content.res.ColorStateList).
zh_cn: 如果你希望在运行时更改此设置，则可以通过 setBackgroundTintList(android.content.res.ColorStateList) 进行更改。

source: If you'd like more information about the Layout Editor itself, see the Android Studio guide to Build a UI with Layout Editor.
zh_cn: 如果你想了解有关布局编辑器本身的更多信息，请参阅 Android Studio 指南 Build a UI with Layout Editor。

source: If you're developing your app for API level 11 and higher only, you should instead use the framework SearchView class.
zh_cn: 如果你 仅 为 API 级别 11 及更高级别开发应用程序，则应使用框架 SearchView 类。

source: If you're editing code, take a few minutes to look at the surrounding code and determine its style.
zh_cn: 如果你正在修改代码，请花几分钟时间看一下周围的代码并确定其样式。

source: If you're familiar with layout_weight in a linear layout, this works the same way.
zh_cn: 如果你熟悉 linear layout 中的 layout_weight 它们的工作方式是相同的。

source: If you're using a ViewPager together with this layout, you can call setupWithViewPager(ViewPager) to link the two together.
zh_cn: 如果你将 ViewPager 与此布局一起使用，则可以调用 setupWithViewPager(ViewPager) 来链接两个在一起。

source: If your RecyclerView is displaying a list that is re-fetched from scratch for each update (e.g. from the network, or from a database), DiffUtil can calculate the difference between versions of the list.
zh_cn: 如果你的 RecyclerView 正在显示从头开始为每次更新(例如从网络或数据库)重新获取的列表，DiffUtil 可以计算版本之间的差异的清单。

source: If your RecyclerView receives updates incrementally, e.g. item X is inserted, or item Y is removed, you can use SortedList to manage your list.
zh_cn: 如果你的 RecyclerView 以递增方式接收更新，例如插入项目 X，或移除项目 Y，你可以使用 SortedList 来管理列表。

source: If your TODO is of the form "At a future date do something" make sure that you either include a very specific date ("Fix by November 2005") or a very specific event ("Remove this code after all production mixers understand protocol V7.").
zh_cn: 如果你的 TODO 采用 "在未来的某个日期做某事" 的形式，请确保在其中包含一个非常具体的日期("在 2005 年 11 月前修复 ")或者一个非常具体的事件(" 在所有生产环境合成器都可处理 V7 协议后移除此代码")。

source: If your activity has an options menu, you can make select items accessible directly from the action bar as "action items".
zh_cn: 如果你的 activity 有一个选项菜单，你可以直接从操作栏中选择可以访问的选项作为“操作项”。

source: If your app needs only scaled images, you can save even more space by having a single variant of an image in drawable-nodpi/.
zh_cn: 如果你的应用只需要缩放图像，则可以通过在 drawable-nodpi/ 中使用单个图像变体来节省更多空间。

source: If your app uses native code and the Android NDK, you can also reduce the size of the release version of your app by optimizing your code.
zh_cn: 如果你的应用使用 native 代码和 Android NDK，你还可以通过优化代码来缩小应用发布版本的大小。

source: If your code must compile under Java 1.3, you must omit the exception that is the cause.
zh_cn: 如果你的代码必须采用 Java 1.3 进行编译，则必须忽略表示原因的异常。

source: If your custom View component is not defined as an inner class, then you can, alternatively, declare the View component with the XML element name, and exclude the class attribute.
zh_cn: 如果你的自定义 View 组件没有定义为内部类，你也可以用 XML 的元素名字来申明 View 组件，而不需要 class 属性。

source: If your debug logs are dominating the log then you probably should be using verbose logging.
zh_cn: 如果你的调试日志是主要日志，那么你可能应采用 VERBOSE 级别的日志记录。

source: If your icon is end-aligned, you cannot use a ".Icon" style and must instead manually adjust your padding such that the visual adjustment is mirrored.
zh_cn: 如果你的图标是末端对齐的，则不能使用“.Icon”样式，而必须手动调整 padding，以便镜像可视调整。

source: If your layout configures more than one drawer view per vertical edge of the window, an exception will be thrown at runtime.
zh_cn: 如果你的布局为窗口的每个垂直边缘配置了多个抽屉 view，则会在运行时抛出异常。

source: If your view class is an inner class, you must further qualify it with the name of the view's outer class.
zh_cn: 如果你的 view 类是内部类，则必须使用 view 人外部类的名称进一步限定它。

source: If your view doesn't need special control over its size, you only need to override one method: onSizeChanged().
zh_cn: 如果你的 view 不需要对其大小进行特殊控制，则只需重写一个方法：onSizeChanged()。

source: If you’re tracking logcat output from the command line, or in a terminal, finding the elapsed time is straightforward.
zh_cn: 如果你正在从命令行或终端中跟踪 logcat 输出，则查找已用时间非常简单。

source: If you’ve overloaded Application.onCreate() in your own app, the system invokes the onCreate() method on your app object.
zh_cn: 如果你在自己的应用程序中重载了 Application.onCreate()，系统会在你的应用程序对象上调用 onCreate() 方法。

source: If, due to lazy loading, an app’s initial display does not include all resources, you might consider the completed loading and display of all resources and views as a separate metric: For example, your UI might be fully loaded, with some text drawn, but not yet display images that the app must fetch from the network.
zh_cn: 如果由于延迟加载，应用程序的初始显示不包含所有资源，你可能会将所有资源和视图的完成加载和显示视为单独的度量标准：例如，你的 UI 可能已完全加载，并绘制了一些文本，但尚未显示应用必须从网络中获取的图像。

source: If, for example, a gone-marked view was alone in a column, that column would itself collapse to zero width if and only if no gravity was defined on the view.
zh_cn: 例如，如果在列中单独存在 gone 标记的 view，则当且仅当 view 上未定义重力时，该列本身将折叠为零宽度。

source: Image files need to use 256 or fewer colors for the aapt tool to optimize them.
zh_cn: 图像文件需要使用 256 或更少的颜色才能由 aapt 工具进行优化。

source: ImageView is also commonly used to apply tints to an image and handle image scaling.
zh_cn: ImageView 也常用于 将色调应用到图像上 并处理 图像缩放。

source: Implement this method to handle generic motion events.
zh_cn: 实现该方法以处理通用的移动事件。

source: Implement this method to handle touch screen motion events.
zh_cn: 实现该方法以处理触屏事件。

source: Implement this method to intercept all touch screen motion events.
zh_cn: 实现此方法以拦截所有触屏动作事件。

source: Implement this to do your drawing.
zh_cn: 实现来完成自己的绘制。

source: Implementation of PagerAdapter that represents each page as a Fragment that is persistently kept in the fragment manager as long as the user can return to the page.
zh_cn: FragmentPagerAdapter 是 PagerAdapter 的实现，它将每个页面表现为 Fragment。只要用户可以返回到页面上，Fragment 就会被持久保存在 fragment manager 中。

source: Implementation of PagerAdapter that uses a Fragment to manage each page.
zh_cn: FragmentStatePagerAdapter 是 PagerAdapter 的一个实现，它使用 Fragment 来管理每一页。

source: Implementations of this method should always call their superclass's implementation of this method if one is present.
zh_cn: 如果存在一个，则此方法的实现应始终调用其超类的此方法的实现。

source: Implementing a Custom View
zh_cn: 实现一个自定义 view

source: Implements a non-terminal append-and-replace step.
zh_cn: 实现非终端添加和替换步骤。

source: Implements a terminal append-and-replace step.
zh_cn: 实现终端添加和替换步骤。

source: Import lines can go over the limit because humans rarely see them (this also simplifies tool writing).
zh_cn: 导入语句行可以超出此限制，因为用户很少会看到它们(这也简化了工具编写流程)。

source: Imports from third parties (com, junit, net, org)
zh_cn: 导入第三方包(com、 junit、 net、 org)

source: In 12-hour mode:
zh_cn: 在 12 小时模式中：

source: In 24-hour mode:
zh_cn: 在 24 小时模式：

source: In KITKAT and below, if this is set to true, then the resulting bitmap will allocate its pixels such that they can be purged if the system needs to reclaim memory.
zh_cn: 在 KITKAT 及以下版本中，如果将其设置为 true，则生成的位图将分配其像素，以便在系统需要回收内存时清除它们。

source: In KITKAT and below, this field works in conjuction with inPurgeable.
zh_cn: 在 KITKAT 及以下版本中，此字段与 inPurgeable 一起使用。

source: In M and below, if dither is true, the decoder will attempt to dither the decoded image.
zh_cn: 在 M 及以下，如果 dither 为 true，解码器将尝试 dither 解码图像。

source: In M and below, if inPreferQualityOverSpeed is set to true, the decoder will try to decode the reconstructed image to a higher quality even at the expense of the decoding speed.
zh_cn: 在 M 及以下，如果 inPreferQualityOverSpeed 设置为 true，则解码器将尝试将重构图像解码为更高质量，即使牺牲解码速度。

source: In M and below, if this can be called from another thread while this options object is inside a decode... call.
zh_cn: 在 M 及其以下，如果可以从另一个线程调用此选项对象在 decode ...调用中时调用此选项。

source: In Android 4.4 (API level 19) and higher, logcat includes an output line containing a value called Displayed.
zh_cn: 在 Android 4.4(API 级别 19)及更高版本中，logcat 包含一个包含名为 Displayed 的值的输出行。

source: In Android 4.4 (API level 19) and higher, the framework supports various densities: ldpi, mdpi, tvdpi, hdpi, xhdpi, xxhdpi and xxxhdpi.
zh_cn: 在 Android 4.4(API 级别 19)及更高版本中，框架支持各种密度：ldpi，mdpi，tvdpi，hdpi, xhdpi，xxhdpi 和 xxxhdpi。

source: In Android Gradle Plugin 0.7 and higher, you can declare the configurations that your app supports.
zh_cn: 在 Android Gradle Plugin 0.7 及更高版本中，你可以声明应用支持的配置。

source: In Android, there are actually two other Views readily available to do this: Spinner and AutoCompleteTextView, but regardless, the concept of a Combo Box makes an easy-to-understand example.
zh_cn: 在安卓中，事实上有 2 个 View 真的可以这样做，Spinner 和 AutoCompleteTextView 但不管怎样，Combo Box 的概念让这个例子更好理解。

source: In Java you can't escape the creepy feeling. -James Gosling
zh_cn: 在 Java 中，你怎么小心都不为过。 -James Gosling

source: In a chain of modules, other than at the VERBOSE level, when a lower-level module detects invalid data coming from a higher-level module, the lower-level module should only log this situation to the DEBUG log, and only if logging provides information that is not otherwise available to the caller.
zh_cn: 在一个模块链中，除了 VERBOSE 级别之外，当较低级别的模块检测到来自较高级别模块的无效数据时，低级模块应该只在 DEBUG 日志中记录该情况，并且仅当该日志提供的信息对调用者来说无法获取时进行记录。

source: In a cold start, your app starts from scratch.
zh_cn: 在冷启动时，你的应用程序从头开始。

source: In a hot start, all the system does is bring your activity to the foreground.
zh_cn: 在热启动中，系统所做的就是把你的 activity 带到前台。

source: In a nutshell, this brings together a number of more atomic controls (or views) into a logical group of items that can be treated as a single thing.
zh_cn: 简而言之，它把更多的原子的控件(或 view)组合在成一个有逻辑的项目组，你可以把它单独的东西来对待。

source: In addition to a few essential methods to control how the contents are presented, it also provides a way to dispatch input events to the connected TvInputService in order to enable custom key actions for the TV input.
zh_cn: 除了控制内容呈现方式的一些基本方法之外，它还提供了一种将输入事件分派给连接的 TvInputService 以便为 TV 输入启用自定义键操作的方法。

source: In addition to being a well-designed class, though, a custom view should:
zh_cn: 除了是一个精心设计的类之外，自定义视图应该：

source: In addition to being a well-designed class, though…
zh_cn: 除了是一个精心设计的类之外，自定义视图应该：

source: In addition to making onDraw() leaner, also make sure it's called as infrequently as possible.
zh_cn: 除了使 onDraw() 更精简之外，还要确保尽可能不频繁地调用它。

source: In addition to the View Framework's measurement cache, RecyclerView uses its own additional measurement cache for its children to avoid re-measuring them when not necessary.
zh_cn: 在 View 框架的测量缓存外，RecyclerView 为自已的子 view 使用自己额外的测量缓存以避免当不需要时重新测量。

source: In addition to the intrinsic capabilities detailed previously, you can also use special helper objects in ConstraintLayout to help you with your layout.
zh_cn: 除了上面详细介绍的内在功能之外，你也可以在 ConstraintLayout 中使用特殊的帮助对象来帮助你完成布局。

source: In addition, XML Drawable objects produce monochromatic images compliant with material design guidelines.
zh_cn: 此外，XML Drawable 对象产生符合材料设计准则的单色图像。

source: In addition, if inScaled is set (which it is by default} and this density does not match inTargetDensity, then the bitmap will be scaled to the target density before being returned.
zh_cn: 另外，如果设置 inScaled（默认情况下）并且此密度与 inTargetDensity 不匹配，那么位图将在返回之前缩放到目标密度。

source: In addition, remember that a @Deprecated method is still supposed to work.
zh_cn: 另外请注意，@Deprecated 方法应该仍然可以使用。

source: In addition, several convenience methods are offered to avoid unnecessary computations, namely getRight() and getBottom().
zh_cn: 此外，也提供几个额外的方法以避免不必要的计算。即 getRight() 和 getBottom()。

source: In addition, this will switch to software when HARDWARE is incompatible, e.g. setMutableRequired(true) or setDecodeAsAlphaMaskEnabled(true).
zh_cn: 此外，当硬件不兼容时，这将切换到软件，例如， setMutableRequired(true) 或 setDecodeAsAlphaMaskEnabled(true)。

source: In almost all cases it is inappropriate to catch generic Exception or Throwable (preferably not Throwable because it includes Error exceptions).
zh_cn: 几乎所有情况下都不适合捕获常规异常或 Throwable(最好不要捕获 Throwable，因为它包含 Error 异常)。

source: In b/73552923, the View is removed by scroll pass while it's waiting in the "pending moving" list of DefaultItemAnimator and DefaultItemAnimator later in a post runnable, incorrectly performs postDelayed() on the detached view.
zh_cn: 在 b/73552923 中，当 view 稍后在 post runnable 中的 DefaultItemAnimator 和 DefaultItemAnimator 的“挂起移动”列表中等待时，该 view 通过滚动过程被移除，在分离的 view 上错误地执行 postDelayed()。

source: In both cases, your app returns the content URI in an Intent sent via setResult().
zh_cn: 在这两种情况下，你的应用程序都会返回通过 setResult() 发送的 Intent 中的 content URI。

source: In case a LayoutManager specifies both constructors, the non-default constructor will take precedence.
zh_cn: 若 LayoutManager 这两种构造方法都申明了，无参的默认构造方法将会调用。 （这一段应该是指在布局文件中申明的 LayoutManager。）。

source: In comparison, to control access to a file:/// Uri you have to modify the file system permissions of the underlying file.
zh_cn: 相比之下，要控制对 file:/// Uri 的访问，你必须修改底层文件的文件系统权限。

source: In fact, you can start by just overriding onDraw(android.graphics.Canvas).
zh_cn: 实事上，你也可以只重定 onDraw(android.graphics.Canvas).

source: In figure 1, the layout looks good in the editor, but there's no vertical constraint on view C. When this layout draws on a device, view C horizontally aligns with the left and right edges of view A, but appears at the top of the screen because it has no vertical constraint.
zh_cn: 在图 1，在布局编辑器上看起来不错，但是在 view C 上没有垂直约束。当这个布局在设备上绘制的时候，view C 与 view A 的左边缘和右边缘水平对齐，但它会出现在屏幕的顶部，因为它没有垂直约束。

source: In figure 2, with the quality set to 75%, there's almost no difference between the two images.
zh_cn: 在图 2 中，质量设置为 75％，两个图像之间几乎没有差异。

source: In figure 4, the left side of the view is connected to the left edge of the parent layout.
zh_cn: 在图 4，view 的左侧连接到父布局的左边缘。

source: In figure 5, B is constrained to always be to the right of A, and C is constrained below A. However, these constraints do not imply alignment, so B can still move up and down.
zh_cn: 在图 5，B 被约束为总是在 A 的右边，并且 C 被约束在 A 的下面。然而，这些约束并不意味着对齐，所以 B 仍然可以上下移动。

source: In figure 6, the left side of B is aligned to the left side of A. If you want to align the view centers, create a constraint on both sides.
zh_cn: 在图 6，B 的左侧与 A 的左侧对齐。如果你要对齐 view 的中心，请在两侧分别创建约束。

source: In figure 8, the first line of B is aligned with the text in A.
zh_cn: 在图 8，B 的第一行与 A 中的文本对齐。

source: In general, the results of the iteration are undefined under these circumstances.
zh_cn: 通常在这些情况下，迭代的结果是不确定的。

source: In lazy loading, an app does not block the initial drawing of the window, but instead asynchronously loads resources and updates the view hierarchy.
zh_cn: 在延迟加载中，应用程序不会阻止窗口的初始绘制，而是异步加载资源并更新视图层次结构。

source: In modern Android UIs developers should lean more on a visually distinct color scheme for toolbars than on their application icon.
zh_cn: 在现代 Android UI 中，开发人员应该更多地依赖于工具栏的视觉上不同的颜色方案而不是应用程序图标。

source: In most cases we dont need call endAnimation() because when view is detached, ViewPropertyAnimation will end.
zh_cn: 在大多数情况下，我们不需要调用 endAnimation()，因为当 view 被分离时，ViewPropertyImation 将结束。

source: In most cases you shouldn't be handling different types of exception the same way.
zh_cn: 在大多数情况下，你不应以相同的方式处理不同类型的异常。

source: In most cases, we recommend using a standard web browser, like Chrome, to deliver content to the user.
zh_cn: 在大多数情况下，我们建议你使用标准网络浏览器(如 Chrome)向用户投放内容。

source: In most cases, you can do what you need from a finalizer with good exception handling.
zh_cn: 在大多数情况下，你可以通过良好的异常处理流程实现终结器功能。

source: In order to avoid having to repeat the long namespace URI, the sample uses an xmlns directive.
zh_cn: 为了避免必须重复长命名空间 URI，该示例使用 xmlns 指令。

source: In order to change any settings, call decodeBitmap(Source, OnHeaderDecodedListener) instead.
zh_cn: 要更改任何设置，请改为调用 decodeBitmap(Source, OnHeaderDecodedListener)。

source: In order to change any settings, call decodeDrawable(Source, OnHeaderDecodedListener) instead.
zh_cn: 要更改任何设置，请改为调用 decodeDrawable(Source, OnHeaderDecodedListener)。

source: In order to cohesively group multiple buttons together, MaterialButtonToggleGroup overrides the start and end margins of any children added to this layout such that child buttons are placed directly adjacent to one another.
zh_cn: 为了将多个按钮内聚在一起，MaterialButtonToggleGroup 会重写添加到此布局的任何子项的开始和结束边距，以便子项按钮直接相邻放置。

source: In order to display items in the list, call setAdapter(android.widget.ListAdapter) to associate an adapter with the list.
zh_cn: 要显示列表中的项目，请调用 setAdapter(android.widget.ListAdapter) 以将适配器与列表相关联。

source: In order to display the partial image, an OnPartialImageListener must be passed to setOnPartialImageListener.
zh_cn: 为了显示部分图像，必须将 OnPartialImageListener 传递给 setOnPartialImageListener。

source: In order to properly diagnose start time performance, you can track metrics that show how long it takes your application to start.
zh_cn: 为了正确诊断开始时间性能，你可以跟踪指示应用程序启动所需时间的指标。

source: In order to properly draw your custom view, you need to know what size it is.
zh_cn: 为了正确绘制自定义 view，你需要知道它的大小。

source: In other words, it provides consistency for the real-world sizes of your UI elements across different devices.
zh_cn: 换句话说，它为不同设备的 UI 元素的实际大小提供了一致性。

source: In particular look at the definition of MyEditText in the NoteEditor.java file.
zh_cn: 特别看一下在 NoteEditor.java 文件中的 MyEditText 的定义。

source: In particular you should eliminate allocations in onDraw(), because allocations may lead to a garbage collection that would cause a stutter.
zh_cn: 特别是你应该消除 onDraw() 中的分配，因为分配可能会导致垃圾收集，从而导致不流畅。

source: In particular, note the definition of LinedEditText in the NoteEditor.java file.
zh_cn: 特别要注意 NoteEditor.java 文件中 LinedEditText 的定义。

source: In particular, the ViewPropertyAnimator class makes animating these View properties particularly easy and efficient.
zh_cn: 特别是 ViewPropertyAnimator 类使 View 的属性动画特别简单有效。

source: In particular, you can remove resources that your app no longer uses, and you can use scalable Drawable objects in place of image files.
zh_cn: 特别是，你可以移除应用程序不再使用的资源，并且可以使用可伸缩的 Drawable 对象代替图像文件。

source: In particular, you can see a mix of both android: namespace parameters and custom app: namespace parameters.
zh_cn: 特别是，你可以看到 android: 命名空间和自定义的 app: 命名空间混合的参数。

source: In rare cases, the default algorithm may not match the intended behavior of the developer.
zh_cn: 在极少数情况下，默认的算法可能不匹配开发者的意图。

source: In response, your app can immediately return a content URI to the client app or present a user interface that allows the user to pick a file.
zh_cn: 作为响应，你的应用程序可以立即将 content URI 返回给客户端应用程序，或者呈现允许用户选择文件的用户界面。

source: In right to left languages it corresponds to the left side of the view
zh_cn: 在从右到左的语言中，它对应的是 view 的左边。

source: In right to left languages it corresponds to the right side of the view
zh_cn: 在从右到左的语言中，它对应的是右边。

source: In some cases, it is acceptable to recycle a View although it has transient state.
zh_cn: 在某些情况下，尽管 View 具有瞬态，但可以回收该 View。

source: In some cases, the ImageDecoder may have decoded part of the image.
zh_cn: 在某些情况下，ImageDecoder 可能已经解码了部分图像。

source: In some cases, the action bar may be overlayed by another bar that enables contextual actions, using an ActionMode.
zh_cn: 在某些情况下，操作栏可能会被另一个使用 ActionMode 启用上下文操作的栏覆盖。

source: In some cases, the convention has changed in important ways and older code might use a deprecated pattern or library.
zh_cn: 在某些情况下，具体规范发生了一些重大变化，旧代码可能使用的是已弃用的模式或库。
